{
  "_name_or_path": "E:/AI/projets/LLM project efrei/llm_project_M2/model/stable-code-3b",
  "architectures": [
    "StableLmForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "eos_token_id": 0,
  "hidden_act": "silu",
  "hidden_dropout": 0.0,
  "hidden_size": 2560,
  "initializer_range": 0.02,
  "intermediate_size": 6912,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 16384,
  "model_type": "stablelm",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 32,
  "partial_rotary_factor": 0.25,
  "qk_layernorm": false,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.47.0",
  "use_cache": true,
  "use_parallel_residual": false,
  "use_qkv_bias": false,
  "vocab_size": 50304
}
